app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `petani`
---
    public function dashboard()
    {
        $petaniModel = new PetaniModel();
        $panenModel  = new PanenModel();

        $data = [
            'totalPetani' => $petaniModel->countAll(),
            'totalPanen'  => $panenModel->countAll(),
        ];

SELECT *
FROM `petani`
---
    public function petani()
    {
        $model = new PetaniModel();
        $data['petani'] = $model->findAll();

SELECT `hasil_panen`.*, `petani`.`nama` as `nama_petani`
FROM `hasil_panen`
JOIN `petani` ON `petani`.`id` = `hasil_panen`.`petani_id`
---
    public function panen()
    {
        $model = new PanenModel();
        $data['panen'] = $model
            ->select('hasil_panen.*, petani.nama as nama_petani')
            ->join('petani', 'petani.id = hasil_panen.petani_id')
            ->findAll();