app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@etani.com'
 LIMIT 1
---
    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();